DOSisbursementFile.txt

<?xml version='1.0' encoding='utf-8'?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:con="http://context.app.fcr.iflex.com" xmlns:spi="http://spi.loans.app.fcr.iflex.com" xmlns:dto="http://dto.loans.app.fcr.iflex.com">
    <soapenv:Body>
        <spi:doDisbursementProcessingForIBOC>
            <spi:sessionContext>
                <con:bankCode>15</con:bankCode>
                <con:channel>LOS</con:channel>
                <con:externalBatchNumber>0</con:externalBatchNumber>
                <con:externalSystemAuditTrailNumber>0</con:externalSystemAuditTrailNumber>
                <con:localDateTimeText/>
                <con:originalReferenceNo/>
                <con:overridenWarnings/>
                <con:postingDateText/>
                <con:reason>
                    <con:comment/>
                    <con:reasonCode>0</con:reasonCode>
                </con:reason>
                <con:serviceCode/>
                <con:sessionTicket/>
                <con:supervisorContext>
                    <con:primaryPassword/>
                    <con:userId/>
                </con:supervisorContext>
                <con:transactionBranch>999</con:transactionBranch>
                <con:userId>IFE</con:userId>
                <con:userReferenceNumber/>
                <con:valueDateText/>
            </spi:sessionContext>
            <spi:loanAccountNo>020450000166</spi:loanAccountNo>
            <spi:flgScenario>2</spi:flgScenario>
            <spi:flgSchemeLn>N</spi:flgSchemeLn>
            <spi:acctType>CH</spi:acctType>
            <spi:disbAmount>40000000</spi:disbAmount>
            <spi:codAcctNoDisb>012205033923</spi:codAcctNoDisb>
            <spi:ledgerCcyShrtName/>
            <spi:ledgerBranchCode/>
            <spi:firstRepayDate>20230205</spi:firstRepayDate>
            <spi:ioiTerm>1</spi:ioiTerm>
            <spi:iBOCdeductionDetailsDTO>
                <dto:ctrSrlDednNo>2</dto:ctrSrlDednNo>
                <dto:deductionAmountInAccountCurrency>17000</dto:deductionAmountInAccountCurrency>
                <dto:deductionCode>568</dto:deductionCode>
                <dto:isWaived>N</dto:isWaived>
            </spi:iBOCdeductionDetailsDTO>
            <spi:iBOCdeductionDetailsDTO>
                <dto:ctrSrlDednNo>3</dto:ctrSrlDednNo>
                <dto:deductionAmountInAccountCurrency>0</dto:deductionAmountInAccountCurrency>
                <dto:deductionCode>568</dto:deductionCode>
                <dto:isWaived>Y</dto:isWaived>
            </spi:iBOCdeductionDetailsDTO>
            <spi:iBOCdeductionDetailsDTO>
                <dto:ctrSrlDednNo>1</dto:ctrSrlDednNo>
                <dto:deductionAmountInAccountCurrency>0</dto:deductionAmountInAccountCurrency>
                <dto:deductionCode>568</dto:deductionCode>
                <dto:isWaived>Y</dto:isWaived>
            </spi:iBOCdeductionDetailsDTO>
            <spi:iBOCdeductionDetailsDTO>
                <dto:ctrSrlDednNo>5</dto:ctrSrlDednNo>
                <dto:deductionAmountInAccountCurrency>0</dto:deductionAmountInAccountCurrency>
                <dto:deductionCode>568</dto:deductionCode>
                <dto:isWaived>Y</dto:isWaived>
            </spi:iBOCdeductionDetailsDTO>
            <spi:iBOCdeductionDetailsDTO>
                <dto:ctrSrlDednNo>4</dto:ctrSrlDednNo>
                <dto:deductionAmountInAccountCurrency>0</dto:deductionAmountInAccountCurrency>
                <dto:deductionCode>568</dto:deductionCode>
                <dto:isWaived>Y</dto:isWaived>
            </spi:iBOCdeductionDetailsDTO>
            <spi:iBOCPayoutDetailsDTO>
                <dto:amtInWords/>
                <dto:codAcctBenef>021450000503</dto:codAcctBenef>
                <dto:codPayoutTcy>0</dto:codPayoutTcy>
                <dto:codRepayMode>E</dto:codRepayMode>
                <dto:ctrSrlNo>1</dto:ctrSrlNo>
                <dto:flgResidual>N</dto:flgResidual>
                <dto:narrative>Top Up 020450000115 </dto:narrative>
                <dto:transferType/>
                <dto:txtBenefAddr1/>
                <dto:txtBenefAddr2/>
                <dto:txtBenefAddr3/>
                <dto:bankCode/>
            </spi:iBOCPayoutDetailsDTO>
        </spi:doDisbursementProcessingForIBOC>
    </soapenv:Body>
</soapenv:Envelope>